kwarc93/audio-multieffect/system/stm32h745/startup.S
.L_loop2:
    cmp r3, r4
    bge .L_loop2_done
    ldr r1, [r3]
    ldr r2, [r3, #4]
    movs    r0, 0

.L_loop2_0:
    subs    r2, #4
    itt ge
    strge   r0, [r1, r2]
    bge .L_loop2_0

    adds    r3, #8
    b   .L_loop2
.L_loop2_done:
#elif defined (__STARTUP_CLEAR_BSS)
/*  Single BSS section scheme.
 *
 *  The BSS section is specified by following symbols
 *    __bss_start__: start of the BSS section.
 *    __bss_end__: end of the BSS section.
 *
 *  Both addresses must be aligned to 4 bytes boundary.
 */
    ldr r1, =__bss_start__
    ldr r2, =__bss_end__

    movs    r0, 0
.L_loop3:
    cmp r1, r2
    itt lt
    strlt   r0, [r1], #4
    blt .L_loop3
#endif /* __STARTUP_CLEAR_BSS_MULTIPLE || __STARTUP_CLEAR_BSS */

#ifndef __NO_SYSTEM_INIT
    bl  system_init
#endif

#ifndef __START
#define __START _start
#endif
    bl  __START

    .pool
    .size   Reset_Handler, . - Reset_Handler

    .align  1
    .thumb_func
    .weak   Default_Handler
    .type   Default_Handler, %function
Default_Handler:
    b   .
    .size   Default_Handler, . - Default_Handler

/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro  def_irq_handler handler_name
    .weak   \handler_name
    .set    \handler_name, Default_Handler
    .endm

    def_irq_handler    NMI_Handler
    def_irq_handler    HardFault_Handler
    def_irq_handler    MemManage_Handler
    def_irq_handler    BusFault_Handler
    def_irq_handler    UsageFault_Handler
    def_irq_handler    SVC_Handler
    def_irq_handler    DebugMon_Handler
    def_irq_handler    PendSV_Handler
    def_irq_handler    SysTick_Handler
    def_irq_handler    WWDG_IRQHandler
    def_irq_handler    PVD_AVD_IRQHandler
    def_irq_handler    TAMP_STAMP_IRQHandler
    def_irq_handler    RTC_WKUP_IRQHandler
    def_irq_handler    FLASH_IRQHandler
    def_irq_handler    RCC_IRQHandler
    def_irq_handler    EXTI0_IRQHandler
    def_irq_handler    EXTI1_IRQHandler
    def_irq_handler    EXTI2_IRQHandler
    def_irq_handler    EXTI3_IRQHandler
    def_irq_handler    EXTI4_IRQHandler
    def_irq_handler    DMA1_Stream0_IRQHandler
    def_irq_handler    DMA1_Stream1_IRQHandler
    def_irq_handler    DMA1_Stream2_IRQHandler
    def_irq_handler    DMA1_Stream3_IRQHandler
    def_irq_handler    DMA1_Stream4_IRQHandler
    def_irq_handler    DMA1_Stream5_IRQHandler
    def_irq_handler    DMA1_Stream6_IRQHandler
    def_irq_handler    ADC_IRQHandler
    def_irq_handler    FDCAN1_IT0_IRQHandler
    def_irq_handler    FDCAN2_IT0_IRQHandler
    def_irq_handler    FDCAN1_IT1_IRQHandler
    def_irq_handler    FDCAN2_IT1_IRQHandler
    def_irq_handler    EXTI9_5_IRQHandler
    def_irq_handler    TIM1_BRK_IRQHandler
    def_irq_handler    TIM1_UP_IRQHandler
    def_irq_handler    TIM1_TRG_COM_IRQHandler
    def_irq_handler    TIM1_CC_IRQHandler
    def_irq_handler    TIM2_IRQHandler
    def_irq_handler    TIM3_IRQHandler
    def_irq_handler    TIM4_IRQHandler
    def_irq_handler    I2C1_EV_IRQHandler
    def_irq_handler    I2C1_ER_IRQHandler
    def_irq_handler    I2C2_EV_IRQHandler
    def_irq_handler    I2C2_ER_IRQHandler
    def_irq_handler    SPI1_IRQHandler
    def_irq_handler    SPI2_IRQHandler
    def_irq_handler    USART1_IRQHandler
    def_irq_handler    USART2_IRQHandler
    def_irq_handler    USART3_IRQHandler
    def_irq_handler    EXTI15_10_IRQHandler
    def_irq_handler    RTC_Alarm_IRQHandler
    def_irq_handler    TIM8_BRK_TIM12_IRQHandler
    def_irq_handler    TIM8_UP_TIM13_IRQHandler
    def_irq_handler    TIM8_TRG_COM_TIM14_IRQHandler
    def_irq_handler    TIM8_CC_IRQHandler
    def_irq_handler    DMA1_Stream7_IRQHandler
    def_irq_handler    FMC_IRQHandler
    def_irq_handler    SDMMC1_IRQHandler
    def_irq_handler    TIM5_IRQHandler
    def_irq_handler    SPI3_IRQHandler
    def_irq_handler    UART4_IRQHandler
    def_irq_handler    UART5_IRQHandler
    def_irq_handler    TIM6_DAC_IRQHandler
    def_irq_handler    TIM7_IRQHandler
    def_irq_handler    DMA2_Stream0_IRQHandler
    def_irq_handler    DMA2_Stream1_IRQHandler
    def_irq_handler    DMA2_Stream2_IRQHandler
    def_irq_handler    DMA2_Stream3_IRQHandler
    def_irq_handler    DMA2_Stream4_IRQHandler
    def_irq_handler    ETH_IRQHandler
    def_irq_handler    ETH_WKUP_IRQHandler
    def_irq_handler    FDCAN_CAL_IRQHandler
    def_irq_handler    CM7_SEV_IRQHandler
    def_irq_handler    CM4_SEV_IRQHandler
    def_irq_handler    DMA2_Stream5_IRQHandler
    def_irq_handler    DMA2_Stream6_IRQHandler
    def_irq_handler    DMA2_Stream7_IRQHandler
    def_irq_handler    USART6_IRQHandler
    def_irq_handler    I2C3_EV_IRQHandler
    def_irq_handler    I2C3_ER_IRQHandler
    def_irq_handler    OTG_HS_EP1_OUT_IRQHandler
    def_irq_handler    OTG_HS_EP1_IN_IRQHandler
    def_irq_handler    OTG_HS_WKUP_IRQHandler
    def_irq_handler    OTG_HS_IRQHandler
    def_irq_handler    DCMI_IRQHandler
    def_irq_handler    RNG_IRQHandler
    def_irq_handler    FPU_IRQHandler
    def_irq_handler    UART7_IRQHandler
    def_irq_handler    UART8_IRQHandler
    def_irq_handler    SPI4_IRQHandler
    def_irq_handler    SPI5_IRQHandler
    def_irq_handler    SPI6_IRQHandler
    def_irq_handler    SAI1_IRQHandler
    def_irq_handler    LTDC_IRQHandler
    def_irq_handler    LTDC_ER_IRQHandler
    def_irq_handler    DMA2D_IRQHandler
    def_irq_handler    SAI2_IRQHandler
    def_irq_handler    QUADSPI_IRQHandler
    def_irq_handler    LPTIM1_IRQHandler
    def_irq_handler    CEC_IRQHandler
    def_irq_handler    I2C4_EV_IRQHandler
    def_irq_handler    I2C4_ER_IRQHandler
    def_irq_handler    SPDIF_RX_IRQHandler
    def_irq_handler    OTG_FS_EP1_OUT_IRQHandler
    def_irq_handler    OTG_FS_EP1_IN_IRQHandler
    def_irq_handler    OTG_FS_WKUP_IRQHandler
    def_irq_handler    OTG_FS_IRQHandler
    def_irq_handler    DMAMUX1_OVR_IRQHandler
    def_irq_handler    HRTIM1_Master_IRQHandler
    def_irq_handler    HRTIM1_TIMA_IRQHandler
    def_irq_handler    HRTIM1_TIMB_IRQHandler
    def_irq_handler    HRTIM1_TIMC_IRQHandler
    def_irq_handler    HRTIM1_TIMD_IRQHandler
    def_irq_handler    HRTIM1_TIME_IRQHandler
    def_irq_handler    HRTIM1_FLT_IRQHandler
    def_irq_handler    DFSDM1_FLT0_IRQHandler
    def_irq_handler    DFSDM1_FLT1_IRQHandler
    def_irq_handler    DFSDM1_FLT2_IRQHandler
    def_irq_handler    DFSDM1_FLT3_IRQHandler
    def_irq_handler    SAI3_IRQHandler
    def_irq_handler    SWPMI1_IRQHandler
    def_irq_handler    TIM15_IRQHandler
    def_irq_handler    TIM16_IRQHandler
    def_irq_handler    TIM17_IRQHandler
    def_irq_handler    MDIOS_WKUP_IRQHandler
    def_irq_handler    MDIOS_IRQHandler
    def_irq_handler    JPEG_IRQHandler
    def_irq_handler    MDMA_IRQHandler
    def_irq_handler    SDMMC2_IRQHandler
    def_irq_handler    HSEM1_IRQHandler
    def_irq_handler    HSEM2_IRQHandler
    def_irq_handler    ADC3_IRQHandler
    def_irq_handler    DMAMUX2_OVR_IRQHandler
    def_irq_handler    BDMA_Channel0_IRQHandler
    def_irq_handler    BDMA_Channel1_IRQHandler
    def_irq_handler    BDMA_Channel2_IRQHandler
    def_irq_handler    BDMA_Channel3_IRQHandler
    def_irq_handler    BDMA_Channel4_IRQHandler
    def_irq_handler    BDMA_Channel5_IRQHandler
    def_irq_handler    BDMA_Channel6_IRQHandler
    def_irq_handler    BDMA_Channel7_IRQHandler
    def_irq_handler    COMP1_IRQHandler
    def_irq_handler    LPTIM2_IRQHandler
    def_irq_handler    LPTIM3_IRQHandler
    def_irq_handler    LPTIM4_IRQHandler
    def_irq_handler    LPTIM5_IRQHandler
    def_irq_handler    LPUART1_IRQHandler
    def_irq_handler    WWDG_RST_IRQHandler
    def_irq_handler    CRS_IRQHandler
    def_irq_handler    ECC_IRQHandler
    def_irq_handler    SAI4_IRQHandler
    def_irq_handler    HOLD_CORE_IRQHandler
    def_irq_handler    WAKEUP_PIN_IRQHandler
   .end
